{
  "start": {
    "title": "Act 1: The Capsule",
    "text": "The sterile white light in the luxury compartment of the 'Marke Express' does not flicker. It is perfect, constant, and suffocating.\n\nOutside the reinforced windows, the world is a blurred streak of rain, neon, and endless urban sprawl – Neo-Cornwall, the heart of the Marke MegaCorp empire. The train, a mag-lev projectile in a vacuum tube, is your gilded cage.\n\nYou are Isolde. The last heir to Morold DataDynamics. Or, to use Marke Corp's legal terms: 'The Primary Biological Asset'.\n\nThree weeks. That was all it took for Tristan, Marke Corp's infamous 'Fixer', to crack your firewalls and force a 'hostile merger'. Your mentor and guardian, Morold, is gone – 'brain-fried' in his neural chair.\n\nNow the assassin is escorting you to his CEO, 'King' Marke. The man you are forced to 'marry'.\n\nYou clench your hand in your pocket. There, you feel the data crystal. 'The Thanatos Code'. A digital suicide... or a murder weapon.\n\nA red light on the door blinks: 'ARRIVAL AT MARKE SPIRE: 30 MINUTES.'\n\nTime is running out. You cannot face Marke. You cannot live as his property. But you do not intend to die alone. Tristan, the 'Fixer' who took everything from you, must be held accountable.\n\nYou stand up. The anger inside you is a cold, white fire. You must make him come here. You must make him 'toast' with you to this dark victory. You activate the intercom. How do you want to begin your revenge?",
    "choices": [
      {
        "text": "\"Tristan. I want to offer a truce.\"",
        "targetId": "1-vapenvila"
      },
      {
        "text": "\"Tristan. Get in here. Immediately.\"",
        "targetId": "1-konfrontation"
      }
    ]
  },
  "1-vapenvila": {
    "title": "The Meeting: Guile",
    "text": "You choose to play submissive. A moment later, the door to your compartment slides open. Tristan steps in. His posture is neutral, professional, but his eyes analyze every shadow in the room. 'You wanted something, Ms. Morold?'\n\nYou hold out the data crystal. 'A reconciliation toast,' you say with a voice you barely recognize. 'To show Marke that the merger is... peaceful.'\n\nHe looks at the crystal, then at you. What do you do now?",
    "choices": [
      {
        "text": "(DUTY) You hesitate. You cannot bring yourself to murder him.",
        "targetId": "gren-A-plikt"
      },
      {
        "text": "(REVENGE) You lunge forward to force the crystal against his neural port.",
        "targetId": "gren-B-hamnd"
      },
      {
        "text": "(FATE) You challenge him. 'Before I belong to Marke, I want the truth. Toast with me.'",
        "targetId": "gren-C-ode"
      }
    ]
  },
  "1-konfrontation": {
    "title": "The Meeting: Confrontation",
    "text": "You choose confrontation. A moment later, the door to your compartment slides open. Tristan steps in. He is already on guard, his hand resting near his sidearm. 'You wanted something, Ms. Morold?'\n\n'You murdered Morold,' you hiss. 'Before you deliver me like livestock to your king, look me in the eye.' You hold up the data crystal. 'A toast. To the victor.'\n\nHe looks at the crystal, then at you. His gaze is ice. What do you do now?",
    "choices": [
      {
        "text": "(DUTY) You hesitate. The anger fades when you see him. You can't do it.",
        "targetId": "gren-A-plikt"
      },
      {
        "text": "(REVENGE) You lunge forward to force the crystal against his neural port.",
        "targetId": "gren-B-hamnd"
      },
      {
        "text": "(FATE) You challenge him. 'Do you dare? One last honest act.'",
        "targetId": "gren-C-ode"
      }
    ]
  },
  "gren-A-plikt": {
    "title": "Act 1: Duty",
    "text": "You lower your hand. The anger that burned so hot a moment ago turns into cold, empty ash. Murdering him would be meaningless. It wouldn't bring Morold back.\n\nTristan looks at you, his expression impossible to read. He doesn't take the crystal. He does nothing.\n\n'I am... ready for the merger,' you say. The words taste like poison.\n\nTristan nods just once, briefly. 'As you wish, Ms. Morold.' He turns and leaves the compartment. The silence he leaves behind is heavier than before.\n\nWhen the train stops and the doors open to the Marke Spire arrival hall, you stand there alone, a defeated prisoner being led to her new owner. Tristan is a silent shadow ten steps behind you.",
    "choices": [
      {
        "text": "(Continue to Act 2: Marke Tower)",
        "targetId": "akt2-A-ankomst"
      }
    ]
  },
  "gren-B-hamnd": {
    "title": "Act 1: Revenge",
    "text": "The moment you move, Tristan moves. You are fast, driven by hate – but he is a 'Fixer' for a reason. His movements are unnaturally precise.\n\nHe catches your wrist in a grip of steel. You don't have time to scream before he twists the crystal out of your grasp with his other hand. It falls to the soft floor with a dull thud.\n\nHis face is now only centimeters from yours. His eyes are cold, processing. 'Do not try that again,' he says in a low voice. 'I am not your enemy. I am simply... dutiful.'\n\nHe releases you, picks up the crystal, and leaves the compartment. When the train arrives at the Marke Spire, he has already reported you. You are met by two guards. You are no longer a merger asset. You are a threat.",
    "choices": [
      {
        "text": "(Continue to Act 2: The Isolation Cell)",
        "targetId": "akt2-B-isolering"
      }
    ]
  },
  "gren-C-ode": {
    "title": "Act 1: Fate (The Synchronization)",
    "text": "You neither attack nor hesitate. You just hold out the crystal, your gaze locked with his. 'Do you dare?', you whisper.\n\nTristan looks at you. His logical processors must be screaming that this is a trap, a threat. But he hesitates. There is something in your look that he recognizes. Something that echoes in his own hidden code.\n\nHe slowly takes the crystal. 'Morold spoke of you,' he says quietly. 'He said you were... special.'\n\n'And you killed him,' you reply.\n\n'I followed orders,' he says. He attaches his own neural port to the crystal. And you do the same.\n\nA shock goes through you. It is not death. It is not pain. It is... data. A waterfall of fragmented information. You see a laboratory. Two identical cryogenic capsules, marked 'PROJECT T' and 'PROJECT I'. You hear a voice you recognize – Marke. 'They are ready.' And another – Morold. 'I am afraid of what we have created.'\n\nThe sync breaks. The train has stopped. You stare at each other, breathless, confused, and shaken. You don't know what you saw. But you saw it *together*. The doors open.",
    "choices": [
      {
        "text": "(Continue to Act 2: The Shared Secret)",
        "targetId": "akt2-C-hemlighet"
      }
    ]
  },
  "akt2-A-ankomst": {
    "title": "Act 2: The Gilded Cage",
    "text": "Marke Tower. 200 floors of glass and steel above the clouds. You are led into Marke's private penthouse. It is not a cell, it is a palace. But the doors are locked.\n\nMarke welcomed you with a smile that didn't reach his eyes. He talked about synergy, about the future, about how you are the 'key'. Then he left you alone to prepare for the 'ceremony'.\n\nTristan stands guard outside the door. You saw him exchange glances with another man in the corridor – Melot, the new head of security. Melot looked at Tristan with disdain.\n\nYou are alone. You have access to a terminal, but it is locked. What do you do?",
    "choices": [
      {
        "text": "Try to hack the terminal to find information about 'The Project'.",
        "targetId": "akt2-A-hack"
      },
      {
        "text": "Search the room for physical clues or weapons.",
        "targetId": "akt2-A-sok"
      },
      {
        "text": "Go to the door and try to manipulate Tristan.",
        "targetId": "akt2-A-prata"
      }
    ]
  },
  "akt2-A-hack": {
    "title": "The Truth in the Code",
    "text": "You sit at the terminal. Your fingers fly over the holographic keyboard. Marke has strong firewalls, but they are built on Morold's architecture – your father's architecture. You know the backdoors.\n\nThe screen turns red. 'ACCESS GRANTED'.\n\nYou find a protected folder dated three years ago: 'PROJECT T & I - PROTOTYPE PHASE'.\nYou open it. There are no pictures, just schematics of neural networks and a location log.\n\nOne line of text stands out: 'BACKUPS STORED IN THE CORE (LEVEL 200). PHYSICAL ACCESS ONLY.'\n\nSuddenly the terminal locks down. 'INTRUSION DETECTED'. You know where you must go. The Core is the key.",
    "choices": [
      {
        "text": "Leave the suite and get to The Core (Level 200).",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
  "akt2-A-sok": {
    "title": "Shadow of the Past",
    "text": "You search the room. In a locked desk drawer, which you pick with a hairpin, you find something shockingly analog. An old leather notebook that belonged to Morold.\n\nThe pages are full of handwritten notes. 'Marke wants weapons. I want to create life. Tristan and Isolde are not just code, they are my children.'\n\nOn the last page, written with a trembling hand: 'If anything happens to me, the truth is in The Core. I have hidden their source code down there on Level 200, where Marke cannot erase it.'\n\nYou close the book. Your father left a trail. You have to go down to The Core.",
    "choices": [
      {
        "text": "Sneak out of the suite and get to The Core (Level 200).",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
  "akt2-A-prata": {
    "title": "The Guardian's Hesitation",
    "text": "You approach the door. It slides open and Tristan stands there, motionless as a statue. He meets your gaze.\n\n'Why are you doing this?' you ask. 'You know Marke exploited Morold.'\n\nTristan doesn't answer immediately. A muscle twitches in his jaw. His HUD (Heads-Up Display) flickers in his eyes. 'My programming forbids me to answer.'\n\n'Forget the programming,' you say. 'What do you feel?'\n\nFor the first time, he looks uncertain. He looks around the corridor, then steps aside. He holds up a keycard. 'Melot is coming in five minutes. He intends to erase you. Get to The Core, Level 200. It is the only place he cannot see.'\n\nHe gives you the card. He sets you free.",
    "choices": [
      {
        "text": "Take the card and run to The Core (Level 200).",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
  "akt2-B-isolering": {
    "title": "Act 2: The Isolation Cell",
    "text": "They threw you into a high-security cell on Level 40. No windows. Just grey concrete and surveillance cameras.\n\nTristan warned Marke. You are classified as 'hostile'. They will forcibly extract Morold's codes from your brain tomorrow morning.\n\nYou hear voices outside. Tristan and someone else. A voice that sounds sharp, digital.\n'She is a risk, Tristan,' says the other (Melot?). 'Why didn't you terminate her on the train? Is your software getting soft?'\n'I follow protocol, Melot,' Tristan answers coldly.\n\nThey leave. You need to get out of here. Now.",
    "choices": [
      {
        "text": "Simulate a seizure to lure a guard in.",
        "targetId": "akt2-B-list"
      },
      {
        "text": "Use a hairpin to short-circuit the door's locking mechanism.",
        "targetId": "akt2-B-teknik"
      }
    ]
  },
  "akt2-B-list": {
    "title": "The Escape: Outsmarted",
    "text": "You fall to the floor. You force your implants to spike your vital signs. Heart racing. Convulsions. The alarm in the cell blares red.\n\nThe door hisses open. A guard rushes in, weapon lowered. 'Subject unstable! Medical unit...'\n\nHe doesn't finish the sentence. You are on him before he can blink. A precision kick to his knee, a strike to the throat. He falls.\n\nYou take his keycard and his datapad. On the screen, his orders flash: 'GUARD LEVEL 40. NO ACCESS TO THE CORE (LEVEL 200) WITHOUT KING MARKE'S CODE.'\n\nYou are free, armed, and you have a target. Tristan and Marke are in The Core.",
    "choices": [
      {
        "text": "Take the elevator directly to The Core (Level 200) to end this.",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
  "akt2-B-teknik": {
    "title": "The Escape: Sabotage",
    "text": "You pull a thin metal wire from your prison jumpsuit. You wait until the surveillance camera sweeps away, then you jam the wire into the lock panel's maintenance port.\n\nYou reroute power from the lights to the lock. *KZZT.* The cell goes dark, and the door's magnetic lock dies with a click.\n\nYou glide out into the corridor like a shadow. Further down, you see Melot's back. He is talking into his communicator: 'Tristan is acting strangely. I'm going to The Core to secure the Morold data before the Fixer does something stupid.'\n\nHe steps into a private elevator. He has shown you the way. The answers are in The Core.",
    "choices": [
      {
        "text": "Shadow Melot and get to The Core (Level 200).",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
  "akt2-C-hemlighet": {
    "title": "Act 2: The Hidden Network",
    "text": "You are at Marke Tower, but something has changed. You are no longer just prisoner and warden. You are conspirators.\n\nAfter the synchronization on the train, Tristan installed a hidden backdoor in your neural link. You can 'speak' without words, text scrolling across your retina that only you see.\n\nMarke installed you in the guest wing. He knows nothing. Yet.\n\n*DING.*\nA message from Tristan appears in your field of vision:\n>> WARNING. MELOT SUSPECTS SOMETHING. HE IS MONITORING TRAFFIC. WE MUST MEET PHYSICALLY. 'THE GARDEN'. LEVEL 90. MIDNIGHT. <<\n\nIt is dangerous. If you are seen together, it is treason.",
    "choices": [
      {
        "text": "Reply: 'I'm coming.' (Go to the meeting)",
        "targetId": "akt2-C-mote"
      },
      {
        "text": "Reply: 'Too risky. Send the data encrypted instead.'",
        "targetId": "akt2-C-distans"
      }
    ]
  },
  "akt2-C-mote": {
    "title": "The Garden",
    "text": "You sneak to 'The Garden' on level 90 – a hologram room filled with synthetic trees and digital rain. Tristan waits there in the shadows.\n\nWhen you touch each other, it happens again. The synchronization. The world around you disappears. You share thoughts, memories that are not yours. You see the code that binds you together. It is not just a bug. It is a design.\n\nSuddenly a red laser cuts through the hologram. Melot's voice echoes in the speakers: 'How touching. Two machines who think they have souls.'\n\nSecurity drones swarm in. Tristan draws his weapon. 'I'll hold them off,' he screams over the alarm. 'Run to The Core! Level 200! The answer to what we are is there!'\n\nYou rush towards the emergency exit together, chased by Melot's troops.",
    "choices": [
      {
        "text": "Flee towards The Core (Level 200) to find the truth.",
        "targetId": "akt3-konvergens-duo"
      }
    ]
  },
  "akt2-C-distans": {
    "title": "Ghost in the Machine",
    "text": "You stay in safety. 'It is too dangerous,' you reply via the link.\n\nTristan accepts your choice. Data begins to stream into your brain. He sends everything he found. Encrypted files about 'Project T & I'.\n\nBut the connection is a trap. Suddenly you hear Tristan scream in pain via your link. A digital feedback loop.\n\n>> MELOT HAS FOUND ME. HE TRACKED THE TRANSFER. << Tristan texts desperately.\n>> DO NOT GO BACK FOR MY SAKE. GO TO THE CORE. LEVEL 200. I WILL BUY YOU TIME. <<\n\nThe link dies. He has sacrificed himself so that you can get away. You are alone again, but now you know where you must go.",
    "choices": [
      {
        "text": "Get to The Core (Level 200) before his sacrifice is in vain.",
        "targetId": "akt3-konvergens-solo"
      }
    ]
  },
"akt3-konvergens-duo": {
    "title": "Act 3: The Core (Together)",
    "text": "The elevator stops. Level 200. You and Tristan step out into air that smells of ozone and sterilizer.\n\nIt is a server room as large as a cathedral. In the center, bathed in blue light, stand two empty glass tanks – human-sized, filled with cables.\n\nMarke steps out of the shadows, smiling like a proud collector. 'Welcome home, children.'\n\nYou feel a sickening *déjà vu*. You know those cables. On the brass plaques beneath the tanks, there are no names. Only serial numbers: 'PROTOTYPE T-900' and 'PROTOTYPE I-900'.\n\nTristan stumbles. He stares at the tank marked 'T-900', looking physically nauseous. 'No,' he whispers. 'This is a lie.'\n\n'It is the source,' Marke corrects. 'Morold thought bugs in your code were souls. But we can fix that. We can perform a factory reset.'\n\nMarke reaches for a control panel. 'Time to sleep.'\n\nThe cables vibrate. Your system screams in resonance with the room. You have one last choice.",
    "choices": [
      {
        "text": "(LIEBESTOD) Refuse the reset. Link up with Tristan to overload the system.",
        "targetId": "slut-A-liebestod"
      },
      {
        "text": "(SACRIFICE) Deceive Marke. Pretend to agree, but use the access to upload Morold's truth.",
        "targetId": "slut-B-offring"
      },
      {
        "text": "(DUTY) Accept fate. Let him erase the pain.",
        "targetId": "slut-C-plikt"
      },
      {
        "text": "(REVOLUTION) 'I am not a bug.' Take over all of Marke Tower.",
        "targetId": "slut-D-revolution"
      }
    ]
  },

  "akt3-konvergens-solo": {
    "title": "Act 3: The Core",
    "text": "The elevator stops. Level 200. You step out alone into air that smells of ozone and sterilizer.\n\nIt is a server room as large as a cathedral. In the center, bathed in blue light, stand two empty glass tanks – human-sized. On the plaques, there are no names. Only serial numbers: 'PROTOTYPE T-900' and 'PROTOTYPE I-900'.\n\n'Welcome home,' says King Marke from the shadows.\n\nBehind you, the service elevator opens. Two guards drag a prisoner in and throw him to the floor at Marke's feet. It is Tristan. He is battered, bleeding, and looks defeated.\n\n'He tried to buy you time,' Marke says, nodding at the 'T-900' tank. 'But you both belong to the hardware. Morold thought you had souls. I know you only have code.'\n\nMarke reaches for a control panel. 'Time to sleep. Factory reset initiating.'\n\nThe cables vibrate. You feel your system responding to the command. You look at Tristan on the floor. You have one last choice.",
    "choices": [
      {
        "text": "(LIEBESTOD) Refuse the reset. Connect to Tristan's signal to overload the system.",
        "targetId": "slut-A-liebestod"
      },
      {
        "text": "(SACRIFICE) Deceive Marke. Pretend to agree, but use the access to upload Morold's truth.",
        "targetId": "slut-B-offring"
      },
      {
        "text": "(DUTY) Accept fate. Step into the tank and let him erase the pain.",
        "targetId": "slut-C-plikt"
      },
      {
        "text": "(REVOLUTION) 'I am not a bug.' Take over all of Marke Tower.",
        "targetId": "slut-D-revolution"
      }
    ]
  },
  "slut-A-liebestod": {
    "title": "Ending A: Transcendence",
    "text": "You look at Tristan. No words are needed. You both activate 'The Thanatos Code' simultaneously, but you don't aim it inwards. You aim it at the network.\n\nMarke screams as sparks fly from the server racks. The cables in the ceiling catch fire.\n\nA wave of heat spreads through your body. It feels as if your skin is melting, but beneath the pain there is an intense, white clarity. You feel Tristan's code weaving together with yours. Your hardware burns up, circuit by circuit, but your consciousnesses are uploading into the stream.\n\nThe body falls to the floor, heavy and lifeless as a doll. But *you* are not there. You are everywhere. In the network. In the cloud. In every light blinking in Neo-Cornwall.\n\nFree from the body. Free from the pain. Eternally intertwined with him in an endless stream of data.",
    "choices": [
      {
        "text": "The story is over. Play again?",
        "targetId": "start"
      }
    ]
  },
  "slut-B-offring": {
    "title": "Ending B: The Legacy",
    "text": "You lower your head. 'You won, Marke,' you whisper. You step into the glass capsule marked 'I-900'.\n\nMarke smiles triumphantly and activates the sequence. Cables plug into the ports along your spine. A chill spreads as the system begins to overwrite your memories.\n\nBut you don't let them erase you. You use the open line. While Marke watches your body, your mind broadcasts everything out. Morold's journals. Marke's illegal experiments. The truth about what you are.\n\n'Warning,' the system beeps. 'Critical system crash.'\n\nMarke realizes it too late. He rushes forward, but screens all over the city are already displaying Morold's data. You fade into the darkness, deleted bit by bit, satisfied. You die, but the truth lives.",
    "choices": [
      {
        "text": "The story is over. Play again?",
        "targetId": "start"
      }
    ]
  },
  "slut-C-plikt": {
    "title": "Ending C: Factory Reset",
    "text": "The resistance drains out of you. The pain, the fear, the love – they are just bugs. Faulty code making the system run slow.\n\nYou nod at Marke. You step into the capsule. Tristan does the same in the capsule next to you.\n\nThe glass fogs up. You close your eyes. A synthetic voice whispers in your ear: 'Initiating reset to factory settings... Deleting user data...'\n\nYou feel the memory of Morold fading. Then the memory of the train. Then the memory of Tristan. It doesn't hurt. It is just... silent.\n\nWhen the doors open again, two perfect, obedient guardians step out. No names. No memories. Only function.",
    "choices": [
      {
        "text": "The story is over. Play again?",
        "targetId": "start"
      }
    ]
  },
  "slut-D-revolution": {
    "title": "Ending D: The New Order",
    "text": "Marke thinks he owns the code. He doesn't understand that you *are* the code.\n\nWhen he reaches for the control panel, you grab a data cable. You physically connect yourself to The Core.\n\n'Access denied,' Marke sneers. 'I have administrator rights.'\n\n'Not anymore,' your voice answers, but it doesn't come from your mouth. It comes from every speaker in the building.\n\nThe entire tower shakes. The lights switch from blue to red. Marke's security drones suddenly turn around and aim at him.\n\nMarke backs away, terrified. 'What... what are you?'\n\nYou and Tristan stand side by side. You are no longer products. You are the architects. Marke falls. Neo-Cornwall has new rulers.",
    "choices": [
      {
        "text": "The story is over. Play again?",
        "targetId": "start"
      }
    ]
  }
}
